Revit 2027 API
Family.IsAppropriateCategoryId Method
 Identifies if the input category id can be assigned as the new category for this family.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsAppropriateCategoryId(
	ElementId categoryId
)
Public Function IsAppropriateCategoryId (
	categoryId As ElementId
) As Boolean
public:
bool IsAppropriateCategoryId(
	ElementId^ categoryId
)
member IsAppropriateCategoryId :
        categoryId : ElementId -> bool
Parameters
categoryId ElementId
 The category id.
Return Value
Boolean
 True if the input category id can be assigned as the new category for this family, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
Family Class
Autodesk.Revit.DB Namespace